In [1]:
# HIDDEN
import warnings
# Ignore numpy dtype warnings. These warnings are caused by an interaction
# between numpy and Cython and can be safely ignored.
# Reference: https://stackoverflow.com/a/40846742
warnings.filterwarnings("ignore", message="numpy.dtype size changed")
warnings.filterwarnings("ignore", message="numpy.ufunc size changed")

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
%matplotlib inline
import ipywidgets as widgets
from ipywidgets import interact, interactive, fixed, interact_manual
import nbinteract as nbi

sns.set()
sns.set_context('talk')
np.set_printoptions(threshold=20, precision=2, suppress=True)
pd.set_option('display.max_rows', 7)
pd.set_option('display.max_columns', 8)
pd.set_option('precision', 2)
# This option stops scientific notation for pandas
# pd.set_option('display.float_format', '{:.2f}'.format)

In [2]:
# HIDDEN
def df_interact(df, nrows=7, ncols=7):
    '''
    Outputs sliders that show rows and columns of df
    '''
    def peek(row=0, col=0):
        return df.iloc[row:row + nrows, col:col + ncols]

    row_arg = (0, len(df), nrows) if len(df) > nrows else fixed(0)
    col_arg = ((0, len(df.columns), ncols)
               if len(df.columns) > ncols else fixed(0))
    
    interact(peek, row=row_arg, col=col_arg)
    print('({} rows, {} columns) total'.format(df.shape[0], df.shape[1]))

def display_df(df, rows=pd.options.display.max_rows,
               cols=pd.options.display.max_columns):
    with pd.option_context('display.max_rows', rows,
                           'display.max_columns', cols):
        display(df)

# Section 4

## Merging

In [4]:
df_steps = pd.read_csv('data/age_steps.csv')
df_income = pd.read_json('data/incomes.json')

In [6]:
df_steps.shape

(11850, 3)

In [7]:
df_income.shape

(13332, 4)

## Mean with missing values

In [20]:
small_steps

       id  age  steps
9412  101   34   7255
8121  102   47   6239
9993  103   37   8342
5575  115   35   7202
46    124   45   7145
5908  127   34   9194
8025  134   47   8145

In [21]:
small_steps['steps'].mean()

7646.0

In [23]:
(small_steps
 .assign(steps=[10, np.nan, 20, np.nan, 10, np.nan, 20])
 ['steps']
 .mean()
)

15.0

## Not missing at random

In [24]:
small_incomes

      first_name   id    income last_name
11132      Wendy  101      0.00    Barnes
8953        Ryan  102  11761.22   Compton
2107        John  106   7734.47  Harrison
9425       Julie  115  24894.40     Smith
2671     Gregory  124  11292.59  Erickson
10311      Karen  127  93539.72    Henson

In [25]:
small_incomes['income'].mean()

24870.399999999998

## Predictions

In [80]:
df = (
    df.dropna()
    .query('steps != -1')
    .query('age >= 18')
)
df

      first_name     id    income last_name  age  steps
0          Brian  84764  99807.16     Wolfe   41   8622
1         George  49337      0.00     Keith   31   9870
3            Bob  98170  18077.78     Perez   34   6987
...          ...    ...       ...       ...  ...    ...
10661        Ian  68473   7617.27     Meyer   40   7895
10662       Carl  60486  34479.99   Russell   49   6004
10663     Curtis  13915  12133.79   Johnson   39   7180

[9053 rows x 6 columns]

In [81]:
a1, b1 = np.polyfit(df['age'], df['income'], 1)
a1, b1

(1074.1595347586629, -18039.20184282822)

In [83]:
pred_75 = a1 * 75 + b1
pred_75

62522.7632640715

## License Plates

In [129]:
def set_cols(df):
    df.columns = ['plate', 'time', 'location']
    return df

def clean_location(df):
    locations = (df['location']
     .str.strip('()')
     .str.split(', ', expand=True)
     .rename(columns={0: 'lat', 1: 'lon'})
     .assign(lat=lambda df: df['lat'].astype(float))
     .assign(lon=lambda df: df['lon'].astype(float))
    )
    return (df.assign(lat=locations['lat'], lon=locations['lon'])
            .drop(columns=['location']))

def convert_times(df):
    return df.assign(time=pd.to_datetime(plates['time'],
                                         format='%m/%d/%Y %I:%M:%S %p'))

def colorize(df):
    def color(t):
        if t.weekday() >= 6:
            return 'green' # Weekend
        if t.hour >= 6 and t.hour <= 17:
            return 'blue' # Weekday daytime
        return 'red' # Weekday evening
    return df.assign(color=df['time'].apply(color))

In [131]:
plates = (pd.read_csv('data/all-lprs.csv.gz')
          .pipe(set_cols)
          .pipe(clean_location)
          .pipe(convert_times)
          .pipe(colorize))
plates

           plate                time   lat     lon color
0        1275226 2011-01-19 02:06:00  37.8 -122.28   red
1         27529C 2011-01-19 02:06:00  37.8 -122.28   red
2        1158423 2011-01-19 02:06:00  37.8 -122.28   red
...          ...                 ...   ...     ...   ...
2742098  5X10319 2013-12-19 20:28:00  37.8 -122.28   red
2742099  7D56240 2013-12-19 20:28:00  37.8 -122.28   red
2742100  6JNM127 2013-12-19 20:28:00  37.8 -122.28   red

[2742101 rows x 5 columns]

In [2]:
import folium
def map_for_license(license):
    m = folium.Map(location=[37.798, -122.276], zoom_start=15)
    for row in plates.loc[plates['plate'] == license].itertuples():
        folium.Marker(
            location=[row.lat, row.lon],
            popup=f'{row.time}',
            icon=folium.Icon(color=row.color)
        ).add_to(m)
    return m

### Jean Quan

In [ ]:
map_for_license('6FCH845')

### Fire Chief

In [ ]:
map_for_license('1328354')

### Random People

In [ ]:
map_for_license('5AJG153')

In [ ]:
map_for_license('6UZA652')